Repository: cimth/Backup
Catalog: Backup/Resources/Lang.*.resx
Languages: de

# ErrorNotExistingProfileDir
source: The directory '{0}' for the backup profiles does not exist!
de: Der Ordner '{0}' für die Backup-Profile existiert nicht!

# StopBecauseOfError
source: The backup got stopped due to an error ...
de: Das Backup wurde aufgrund eines Fehlers abgebrochen!

source: Error message:
de: Fehlermeldung:

# InvalidInput
source: Invalid input! Please enter a valid value.
de: Ungültige Eingabe! Bitte geben Sie einen gültigen Wert ein.

# InvalidNumber
source: Invalid input! Please choose one of the given profiles via entering the leading number!
de: Ungültige Eingabe! Bitte eine der angegebenen Profile durch Eingabe der vorangestellten Nummer wählen!

# NoProfileAtPath
source: There is no XML-file which might contain a backup profile at the path '{0}'!
de: Unter dem Pfad '{0}' existiert keine XML-Datei, die ein Backup-Profil enthalten kann!

# NoProfileAtPathHelp
source: Please add a XML specifying a backup profile with the following scheme under the given path: <?xml version="1.0" encoding="utf-8"?> <backup_profile> <name>Profile Name</name> <backup_location> <path>/path/to_backup</path> <dest>/path/is_backup</dest> <exclude> <path>/path/to_backup/optional_exclude</path> </exclude> </backup_location> </backup_profile>
de: Zum Nutzen des Programms muss eine XML-Datei nach folgendem Schema in dem Ordner erstellt werden: <?xml version="1.0" encoding="utf-8"?> <backup_profile> <name>Profile Name</name> <backup_location> <path>/path/to_backup</path> <dest>/path/is_backup</dest> <exclude> <path>/path/to_backup/optional_exclude</path> </exclude> </backup_location> </backup_profile>

# ErrorXmlMissingBackupLocations
source: The XML-file has not the outer elements '/backup_profile/backup_location'
de: Die XML-Datei hat nicht die äußeren Elemente '/backup_profile/backup_location'

# ErrorXmlMalformatted
source: The XML-file is malformatted.
de: Die XML-Datei ist fehlerhaft aufgebaut.

# ErrorXmlNodes
source: There are missing or invalid elements in the selected backup location file!
de: Es fehlen Elemente in der gewählten BackupLocation-Datei oder sind ungültig!

# ErrorXmlSrc
source: The 'src'-path of the following backup location is missing or invalid: {0}
de: Der 'src'-Pfad der folgenden Backup Location fehlt oder ist ungültig: {0}

# ErrorXmlDest
source: The 'dest'-path of the following backup location is missing: {0}
de: Der 'dest'-Pfad der folgenden Backup Location fehlt: {0}

# ErrorXmlExcludeMissingPaths
source: The 'exclude'-element of the following backup location is missing 'path' sub-elements: {0}
de: Das 'exclude'-Element der folgenden Backup Location hat keine 'path'-Sub-Elemente: {0}

# ErrorXmlExcludeInvalidPath
source: The 'exclude'-path '{0}' is invalid.
de: Der 'exclude'-Pfad '{0}' ist ungültig.

# Start
source: Welcome at the Backup! Please enter the number of the backup profile you wish to run.
de: Willkommen beim Backup! Bitte geben Sie die Zahl des auszuführenden Backup-Profils ein.

# DryRunInfo
source: If you add the flag '--dry' after the number (e.g. '1 --dry') the changes which would be made by the backup will only be shown but not performed.
de: Wenn das Flag '--dry' nach der Zahl eingefügt wird (z.B. '1 --dry'), werden die Änderungen, die von dem Backup durchgeführt werden sollen, nur angezeigt und nicht tatsächlich vorgenommen.

source: Backup profiles:
de: Backup-Profile:

source: Chosen profile:
de: Ausgewähltes Profil:

source: Start backup ...
de: Starte Backup ...

# DoDryRun
source: This is a dry run so that the shown changes are NOT performed in real. Use the output to check whether the chosen backup profile works as expected.
de: Dies ist ein Probelauf (gesetztes '--dry'-Flag), bei dem die angezeigten Änderungen NICHT durchgeführt werden. Die Ausgabe kann verwendet werden, um sicherzustellen, dass das ausgewählte Backup-Profil wie erwartet funktioniert.

# EndProgram
source: To close the application please press [RETURN].
de: Zum Beenden des Programms bitte [ENTER] drücken.

# AnotherRun
source: Do you want to run another backup? [y/N]
de: Soll noch ein weiteres Backup durchgeführt werden? [y/N]

# OptionCancel
source: Cancel
de: Abbrechen

# SelectExit
source: The application will not run a backup.
de: Das Programm wird kein Backup durchführen.

# CheckBackupLocation
source: Check Backup Location: {0}
de: Überprüfe Backup Location: {0}

# SuccessNoUpdate
source: Backup successful! All files already were up-to-date.
de: Backup durchgeführt! Alle Dateien waren bereits aktuell.

# SuccessUpdate
source: Backup successful! All files were successfully updated.
de: Backup durchgeführt! Alle Dateien wurden auf den aktuellen Stand gebracht.

# SuccessDryRun
source: Dry run successful! Note that the changes listed above (if existing) are visual only. No real change had been made due to the dry run.
de: Probelauf durchgeführt! Die oben aufgeführten Änderungen (falls vorhanden) sind rein visuell. Es wurde aufgrund des Probelaufs keine der Änderungen tatsächlich durchgeführt.
